Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.ConstructionMethod Property
 Gets or sets the construction method of the analysis model.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisModel.ConstructionMethodEnum ConstructionMethod { get; set; }
Public Property ConstructionMethod As AnalysisModel.ConstructionMethodEnum
	Get
	Set
Property Value
Type: AnalysisModel.ConstructionMethodEnum
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace